sources/AccumulationRegisters/Занятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Занятия</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Балл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Преподаватели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодУчебы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБалла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБаллов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

sources/AccumulationRegisters/Аттестация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Аттестация</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Балл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Преподаватели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодУчебы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипАттестации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипАттестации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

sources/Enums/ТипыБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыБаллов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отсутствие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оценка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

sources/Enums/ТипАттестации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипАттестации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аттестация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исправление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

sources/Catalogs/Студенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Студенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчислен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Староста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятВГруппу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдаленИзГруппы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

sources/Catalogs/Предметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Предметы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Преподаватели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодУчебы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шифр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуквенныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

sources/CommonModules/РаботаСАналитикой/Ext/Module.bsl
// Производит аналитику успеваемости в целом по студенту
//
// Параметры:
//  Студент  - СправочникСсылка.Студенты
//
// Возвращаемое значение:
//   ТабличныйДокумент   - содержит анализ
//
Функция ПровестиОбщуюСтатистикуДляСтудента(Студент) Экспорт
	
	ТекГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	
	Анализ = Новый АнализДанных;

	Анализ.ТипАнализа = Тип("АнализДанныхОбщаяСтатистика"); 

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗанятияОбороты.Предмет КАК Предмет,
		|	ЗанятияОбороты.БаллОборот КАК Оценка
		|ИЗ
		|	РегистрНакопления.Занятия.Обороты(
		|			&НачГода,
		|			&КонГода,
		|			Запись,
		|			Преподаватель = &Преподаватель
		|				И Студент = &Студент
		|				И ПериодУчебы = &ПериодУчебы
		|				И ТипБалла = &ТипБалла) КАК ЗанятияОбороты";
	
	Запрос.УстановитьПараметр("КонГода", ТекГод.КонецГода);
	Запрос.УстановитьПараметр("НачГода", ТекГод.НачалоГода);
	Запрос.УстановитьПараметр("ПериодУчебы", ТекГод.Период);
	Запрос.УстановитьПараметр("Преподаватель", ПараметрыСеанса.ТекПользователь);
	Запрос.УстановитьПараметр("Студент", Студент);
	Запрос.УстановитьПараметр("ТипБалла", Перечисления.ТипыБаллов.Оценка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Анализ.ИсточникДанных = РезультатЗапроса;
	РезультатАнализа = Анализ.Выполнить();
	
	Построитель = Новый ПостроительОтчетаАнализаДанных();
	Построитель.Макет = Неопределено;
	Построитель.ТипАнализа = Тип("АнализДанныхОбщаяСтатистика");
	
	ТабДок = Новый ТабличныйДокумент;
	Построитель.Вывести(РезультатАнализа, ТабДок); 
	
	Возврат ТабДок;	

КонецФункции // ПровестиАналитикуДляСтудента()

// Производит аналитику аттестованности
//
// Параметры:
//  Период  - СтандартныйПериод
//  Группа  - СправочникСсылка.Группы
//
// Возвращаемое значение:
//   ТабличныйДокумент   - содержит анализ
//
Функция ПровестиАналитикуАттестованностиДляГруппы(Период, Группа) Экспорт
	
	ТаблЗнач = Новый ТаблицаЗначений;
	ТаблЗнач.Колонки.Добавить("Студент");
	ТаблЗнач.Колонки.Добавить("Предмет");
	ТаблЗнач.Колонки.Добавить("КоличествоПоложительныхОценок");
	ТаблЗнач.Колонки.Добавить("КоличествоДвоек");
	ТаблЗнач.Колонки.Добавить("КоличествоПропусков");
	ТаблЗнач.Колонки.Добавить("Аттестация");
	
	ТекГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	
	Анализ = Новый АнализДанных;

	Анализ.ТипАнализа = Тип("АнализДанныхДеревоРешений"); 

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Студенты.Ссылка КАК Ссылка,
		|	Студенты.Наименование КАК Наименование
		|ПОМЕСТИТЬ Студ
		|ИЗ
		|	Справочник.Студенты КАК Студенты
		|ГДЕ
		|	Студенты.Группа = &Группа
		|	И Студенты.Отчислен = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятияОбороты.Студент КАК Студент,
		|	ЗанятияОбороты.Предмет КАК Предмет
		|ПОМЕСТИТЬ СтудПредм
		|ИЗ
		|	РегистрНакопления.Занятия.Обороты(
		|			&НачПериод,
		|			&КонПериод,
		|			,
		|			ПериодУчебы = &ПериодУчебы
		|				И Преподаватель = &Преподаватель
		|				И Студент В
		|					(ВЫБРАТЬ
		|						Студ.Ссылка КАК Ссылка
		|					ИЗ
		|						Студ КАК Студ)) КАК ЗанятияОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АттестацияОбороты.Студент КАК Студент,
		|	АттестацияОбороты.Предмет КАК Предмет,
		|	ВЫБОР
		|		КОГДА АттестацияОбороты.БаллОборот > 2
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Аттестован
		|ПОМЕСТИТЬ Аттест
		|ИЗ
		|	РегистрНакопления.Аттестация.Обороты(
		|			&НачПериод,
		|			&КонПериод,
		|			,
		|			ПериодУчебы = &ПериодУчебы
		|				И Преподаватель = &Преподаватель
		|				И (Студент, Предмет) В
		|					(ВЫБРАТЬ
		|						СтудПредм.Студент КАК Студент,
		|						СтудПредм.Предмет КАК Предмет
		|					ИЗ
		|						СтудПредм КАК СтудПредм)
		|				И ТипАттестации = &ТипАттестации) КАК АттестацияОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Аттест.Студент КАК Студент,
		|	Аттест.Предмет КАК Предмет,
		|	Аттест.Аттестован КАК Аттестован,
		|	ВЫБОР
		|		КОГДА ЗанятияОбороты.БаллОборот > 2
		|				И ЗанятияОбороты.ТипБалла = &ТипО
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Полож,
		|	ВЫБОР
		|		КОГДА ЗанятияОбороты.БаллОборот = 2
		|				И ЗанятияОбороты.ТипБалла = &ТипО
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Двойки,
		|	ВЫБОР
		|		КОГДА ЗанятияОбороты.БаллОборот = 1
		|				И ЗанятияОбороты.ТипБалла = &ТипП
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Пропуск
		|ИЗ
		|	Аттест КАК Аттест
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Занятия.Обороты(
		|				&НачПериод,
		|				&КонПериод,
		|				Запись,
		|				Преподаватель = &Преподаватель
		|					И ПериодУчебы = &ПериодУчебы
		|					И Студент В
		|						(ВЫБРАТЬ
		|							Студ.Ссылка КАК Ссылка
		|						ИЗ
		|							Студ КАК Студ)) КАК ЗанятияОбороты
		|		ПО Аттест.Студент = ЗанятияОбороты.Студент
		|			И Аттест.Предмет = ЗанятияОбороты.Предмет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Студент,
		|	Предмет
		|ИТОГИ
		|	МАКСИМУМ(Аттестован),
		|	СУММА(Полож),
		|	СУММА(Двойки),
		|	СУММА(Пропуск)
		|ПО
		|	Студент,
		|	Предмет";
	
	Запрос.УстановитьПараметр("КонПериод", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("НачПериод", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодУчебы", ТекГод.Период);
	Запрос.УстановитьПараметр("Преподаватель", ПараметрыСеанса.ТекПользователь);
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("ТипО", Перечисления.ТипыБаллов.Оценка);
	Запрос.УстановитьПараметр("ТипП", Перечисления.ТипыБаллов.Отсутствие);  
	Запрос.УстановитьПараметр("ТипАттестации", Перечисления.ТипАттестации.Аттестация);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСтудента = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтудента.Следующий() Цикл
	
		ВыборкаПредметаСтудента = ВыборкаСтудента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПредметаСтудента.Следующий() Цикл
		
			Стр = ТаблЗнач.Добавить();
			Стр.Студент = ВыборкаПредметаСтудента.Студент;
			Стр.Предмет = ВыборкаПредметаСтудента.Предмет;
			Если ВыборкаПредметаСтудента.Аттестован = 1 Тогда
				
				Стр.Аттестация = "Аттестован";
				
			Иначе
				
				Стр.Аттестация = "Неттестован";
				
			КонецЕсли;
			
			Стр.КоличествоПоложительныхОценок = ВыборкаПредметаСтудента.Полож;
			Стр.КоличествоДвоек = ВыборкаПредметаСтудента.Двойки;
			Стр.КоличествоПропусков = ВыборкаПредметаСтудента.Пропуск;

		КонецЦикла;
	
	КонецЦикла;
	
	Анализ.ИсточникДанных = ТаблЗнач; 
	Анализ.Параметры.ТипУпрощения.Значение = ТипУпрощенияДереваРешений.НеУпрощать;
	РезультатАнализа = Анализ.Выполнить();
	
	Построитель = Новый ПостроительОтчетаАнализаДанных();
	Построитель.Макет = Неопределено;
	Построитель.ТипАнализа = Тип("АнализДанныхДеревоРешений");
	
	ТабДок = Новый ТабличныйДокумент;
	Построитель.Вывести(РезультатАнализа, ТабДок); 
	
	Возврат ТабДок;	

КонецФункции // ПровестиАналитикуАттестованностиДляГруппы()

// Производит аналитику кластеризации
//
// Параметры:
//  Период  - СтандартныйПериод
//  Группа  - СправочникСсылка.Группы
//
// Возвращаемое значение:
//   ТабличныйДокумент   - содержит анализ
//
Функция ПровестиАналитикуКластеризацииДляГруппы(Период, Группа) Экспорт
	
	ТаблЗнач = Новый ТаблицаЗначений;
	ТаблЗнач.Колонки.Добавить("Студент");
	ТаблЗнач.Колонки.Добавить("Предмет");
	ТаблЗнач.Колонки.Добавить("КоличествоПоложительныхОценок");
	ТаблЗнач.Колонки.Добавить("КоличествоДвоек");
	ТаблЗнач.Колонки.Добавить("КоличествоПропусков");
	ТаблЗнач.Колонки.Добавить("Аттестация");
	
	ТекГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	
	Анализ = Новый АнализДанных;

	Анализ.ТипАнализа = Тип("АнализДанныхКластеризация"); 

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Студенты.Ссылка КАК Ссылка,
		|	Студенты.Наименование КАК Наименование
		|ПОМЕСТИТЬ Студ
		|ИЗ
		|	Справочник.Студенты КАК Студенты
		|ГДЕ
		|	Студенты.Группа = &Группа
		|	И Студенты.Отчислен = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятияОбороты.Студент КАК Студент,
		|	ЗанятияОбороты.Предмет КАК Предмет
		|ПОМЕСТИТЬ СтудПредм
		|ИЗ
		|	РегистрНакопления.Занятия.Обороты(
		|			&НачПериод,
		|			&КонПериод,
		|			,
		|			ПериодУчебы = &ПериодУчебы
		|				И Преподаватель = &Преподаватель
		|				И Студент В
		|					(ВЫБРАТЬ
		|						Студ.Ссылка КАК Ссылка
		|					ИЗ
		|						Студ КАК Студ)) КАК ЗанятияОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АттестацияОбороты.Студент КАК Студент,
		|	АттестацияОбороты.Предмет КАК Предмет,
		|	ВЫБОР
		|		КОГДА АттестацияОбороты.БаллОборот > 2
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Аттестован
		|ПОМЕСТИТЬ Аттест
		|ИЗ
		|	РегистрНакопления.Аттестация.Обороты(
		|			&НачПериод,
		|			&КонПериод,
		|			,
		|			ПериодУчебы = &ПериодУчебы
		|				И Преподаватель = &Преподаватель
		|				И (Студент, Предмет) В
		|					(ВЫБРАТЬ
		|						СтудПредм.Студент КАК Студент,
		|						СтудПредм.Предмет КАК Предмет
		|					ИЗ
		|						СтудПредм КАК СтудПредм)
		|				И ТипАттестации = &ТипАттестации) КАК АттестацияОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Аттест.Студент КАК Студент,
		|	Аттест.Предмет КАК Предмет,
		|	Аттест.Аттестован КАК Аттестован,
		|	ВЫБОР
		|		КОГДА ЗанятияОбороты.БаллОборот > 2
		|				И ЗанятияОбороты.ТипБалла = &ТипО
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Полож,
		|	ВЫБОР
		|		КОГДА ЗанятияОбороты.БаллОборот = 2
		|				И ЗанятияОбороты.ТипБалла = &ТипО
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Двойки,
		|	ВЫБОР
		|		КОГДА ЗанятияОбороты.БаллОборот = 1
		|				И ЗанятияОбороты.ТипБалла = &ТипП
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Пропуск
		|ИЗ
		|	Аттест КАК Аттест
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Занятия.Обороты(
		|				&НачПериод,
		|				&КонПериод,
		|				Запись,
		|				Преподаватель = &Преподаватель
		|					И ПериодУчебы = &ПериодУчебы
		|					И Студент В
		|						(ВЫБРАТЬ
		|							Студ.Ссылка КАК Ссылка
		|						ИЗ
		|							Студ КАК Студ)) КАК ЗанятияОбороты
		|		ПО Аттест.Студент = ЗанятияОбороты.Студент
		|			И Аттест.Предмет = ЗанятияОбороты.Предмет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Студент,
		|	Предмет
		|ИТОГИ
		|	МАКСИМУМ(Аттестован),
		|	СУММА(Полож),
		|	СУММА(Двойки),
		|	СУММА(Пропуск)
		|ПО
		|	Студент,
		|	Предмет";
	
	Запрос.УстановитьПараметр("КонПериод", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("НачПериод", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодУчебы", ТекГод.Период);
	Запрос.УстановитьПараметр("Преподаватель", ПараметрыСеанса.ТекПользователь);
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("ТипО", Перечисления.ТипыБаллов.Оценка);
	Запрос.УстановитьПараметр("ТипП", Перечисления.ТипыБаллов.Отсутствие);  
	Запрос.УстановитьПараметр("ТипАттестации", Перечисления.ТипАттестации.Аттестация);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСтудента = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтудента.Следующий() Цикл
	
		ВыборкаПредметаСтудента = ВыборкаСтудента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПредметаСтудента.Следующий() Цикл
		
			Стр = ТаблЗнач.Добавить();
			Стр.Студент = ВыборкаПредметаСтудента.Студент;
			Стр.Предмет = ВыборкаПредметаСтудента.Предмет;
			Если ВыборкаПредметаСтудента.Аттестован = 1 Тогда
				
				Стр.Аттестация = "Аттестован";
				
			Иначе
				
				Стр.Аттестация = "Неттестован";
				
			КонецЕсли;
			
			Стр.КоличествоПоложительныхОценок = ВыборкаПредметаСтудента.Полож;
			Стр.КоличествоДвоек = ВыборкаПредметаСтудента.Двойки;
			Стр.КоличествоПропусков = ВыборкаПредметаСтудента.Пропуск;

		КонецЦикла;
	
	КонецЦикла;
	
	Анализ.ИсточникДанных = ТаблЗнач; 
	РезультатАнализа = Анализ.Выполнить();
	
	Построитель = Новый ПостроительОтчетаАнализаДанных();
	Построитель.Макет = Неопределено;
	Построитель.ТипАнализа = Тип("АнализДанныхКластеризация");
	
	ТабДок = Новый ТабличныйДокумент;
	Построитель.Вывести(РезультатАнализа, ТабДок); 
	
	Возврат ТабДок;	

КонецФункции // ПровестиАналитикуДляСтудента()

// Производит аналитику с какой долей вероятности и с кем студент будет отсутствовать
//
// Параметры:
//  ПериодПредмет  - СтандартныйПериод И СправочникСсылка.Предметы
//  Студент  - СправочникСсылка.Студенты
//
// Возвращаемое значение:
//   ТабличныйДокумент   - содержит анализ
//
Функция ПровестиПоискПропусковЗаПериодПоСтуденту(ПериодПредмет, Студент) Экспорт
	
	ТаблЗнач = Новый ТаблицаЗначений;
	ТаблЗнач.Колонки.Добавить("Студ");
	ТаблЗнач.Колонки.Добавить("Пропусков");
	
	ТаблЗначАнализ = Новый ТаблицаЗначений;
	ТаблЗначАнализ.Колонки.Добавить("Студ");
	ТаблЗначАнализ.Колонки.Добавить("Пропусков");
	ТаблЗначАнализ.Колонки.Добавить("ПроцПроп");
	
	ТекГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	
	Если ПериодПредмет.Предмет = Справочники.Предметы.ПустаяСсылка() Тогда
	
		  Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗанятияОбороты.Студент КАК СтудентАнализ,
				|	ЗанятияОбороты.БаллОборот КАК Пропусков
				|ПОМЕСТИТЬ Врем
				|ИЗ
				|	РегистрНакопления.Занятия.Обороты(
				|			&НачПериод,
				|			&КонПериод,
				|			,
				|			Студент = &Студент
				|				И ПериодУчебы = &ПериодУчебы
				|				И ТипБалла = &ТипБалла) КАК ЗанятияОбороты
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Врем.СтудентАнализ КАК СтудентАнализ,
				|	Врем.Пропусков КАК Пропусков,
				|	ВЫБОР
				|		КОГДА ЗанятияОбороты.Студент <> Врем.СтудентАнализ
				|			ТОГДА ЗанятияОбороты.Студент
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК Студент,
				|	ЗанятияОбороты.БаллОборот КАК БаллОборот
				|ИЗ
				|	Врем КАК Врем,
				|	РегистрНакопления.Занятия.Обороты(
				|			&НачПериод,
				|			&КонПериод,
				|			Запись,
				|			ПериодУчебы = &ПериодУчебы
				|				И ТипБалла = &ТипБалла
				|				И Студент В
				|					(ВЫБРАТЬ
				|						Студенты.Ссылка КАК Ссылка
				|					ИЗ
				|						Справочник.Студенты КАК Студенты
				|					ГДЕ
				|						Студенты.Группа = &Группа)) КАК ЗанятияОбороты
				|ИТОГИ
				|	МАКСИМУМ(Пропусков),
				|	СУММА(БаллОборот)
				|ПО
				|	СтудентАнализ,
				|	Студент";
			

			Запрос.УстановитьПараметр("Студент", Студент);
			Запрос.УстановитьПараметр("Группа", Студент.Группа);
			Запрос.УстановитьПараметр("КонПериод", КонецДня(ПериодПредмет.Период.ДатаОкончания));
			Запрос.УстановитьПараметр("НачПериод", ПериодПредмет.Период.ДатаНачала);
			Запрос.УстановитьПараметр("ПериодУчебы", ТекГод.Период);
			Запрос.УстановитьПараметр("ТипБалла", Перечисления.ТипыБаллов.Отсутствие);
			
	Иначе
			
			    Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЗанятияОбороты.Студент КАК СтудентАнализ,
					|	ЗанятияОбороты.БаллОборот КАК Пропусков
					|ПОМЕСТИТЬ Врем
					|ИЗ
					|	РегистрНакопления.Занятия.Обороты(
					|			&НачПериод,
					|			&КонПериод,
					|			,
					|			Студент = &Студент
					|				И ПериодУчебы = &ПериодУчебы
					|				И ТипБалла = &ТипБалла
					|				И Предмет = &Предмет) КАК ЗанятияОбороты
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	Врем.СтудентАнализ КАК СтудентАнализ,
					|	Врем.Пропусков КАК Пропусков,
					|	ВЫБОР
					|		КОГДА ЗанятияОбороты.Студент <> Врем.СтудентАнализ
					|			ТОГДА ЗанятияОбороты.Студент
					|		ИНАЧЕ 0
					|	КОНЕЦ КАК Студент,
					|	ЗанятияОбороты.БаллОборот КАК БаллОборот
					|ИЗ
					|	Врем КАК Врем,
					|	РегистрНакопления.Занятия.Обороты(
					|			&НачПериод,
					|			&КонПериод,
					|			Запись,
					|			ПериодУчебы = &ПериодУчебы
					|				И ТипБалла = &ТипБалла
					|				И Студент В
					|					(ВЫБРАТЬ
					|						Студенты.Ссылка КАК Ссылка
					|					ИЗ
					|						Справочник.Студенты КАК Студенты
					|					ГДЕ
					|						Студенты.Группа = &Группа)
					|				И Предмет = &Предмет) КАК ЗанятияОбороты
					|ИТОГИ
					|	МАКСИМУМ(Пропусков),
					|	СУММА(БаллОборот)
					|ПО
					|	СтудентАнализ,
					|	Студент";
				

				Запрос.УстановитьПараметр("Студент", Студент);
				Запрос.УстановитьПараметр("Предмет", ПериодПредмет.Предмет);
				Запрос.УстановитьПараметр("Группа", Студент.Группа);
				Запрос.УстановитьПараметр("КонПериод", КонецДня(ПериодПредмет.Период.ДатаОкончания));
				Запрос.УстановитьПараметр("НачПериод", ПериодПредмет.Период.ДатаНачала);
				Запрос.УстановитьПараметр("ПериодУчебы", ТекГод.Период);
				Запрос.УстановитьПараметр("ТипБалла", Перечисления.ТипыБаллов.Отсутствие);
			
			
	КонецЕсли;
		
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СуммаПропусковСоВсеми = 0;
	СуммаСвоихПропусков = 0;
	ВыборкаСтудентАнализ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтудентАнализ.Следующий() Цикл
	
		ВыборкаСтудент = ВыборкаСтудентАнализ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	    Пока ВыборкаСтудент.Следующий() Цикл
			Если ВыборкаСтудент.Студент <> 0 И ВыборкаСтудент.БаллОборот <= ВыборкаСтудент.Пропусков*1.2 
				И ВыборкаСтудент.БаллОборот >= ВыборкаСтудент.Пропусков*0.8 Тогда
				Строка = ТаблЗнач.Добавить();
				Строка.Студ = ВыборкаСтудент.Студент;
				Строка.Пропусков = ВыборкаСтудент.БаллОборот;
				
				СуммаПропусковСоВсеми = СуммаПропусковСоВсеми + Строка.Пропусков; 
				СуммаСвоихПропусков = ВыборкаСтудент.Пропусков;
			КонецЕсли;
			
	
		КонецЦикла;
	
	КонецЦикла; 
	
	Для каждого Стр Из ТаблЗнач Цикл
	
		Строка = ТаблЗначАнализ.Добавить();
		Строка.Студ = Стр.Студ;
		Строка.Пропусков = Стр.Пропусков;
		Строка.ПроцПроп = Окр(?(СуммаПропусковСоВсеми = 0, 0, Стр.Пропусков/СуммаПропусковСоВсеми)*100,2);

	КонецЦикла;
	
	ТаблЗначАнализ.Сортировать("ПроцПроп Убыв, Студ Возр");
	
	Адрес = ПоместитьВоВременноеХранилище(ТаблЗначАнализ);
	МасВозврата = Новый Массив;
	МасВозврата.Добавить(Адрес); 
	МасВозврата.Добавить(СуммаСвоихПропусков);
	МасВозврата.Добавить(Студент);
	
	Возврат МасВозврата;	

КонецФункции // ПровестиПоискПропусковЗаПериодПоСтуденту()
